---
kind: type
id: T:Autodesk.Revit.DB.Structure.YJustification
source: html/3f22ee55-5f27-bd05-2947-e023528a719a.htm
---
# Autodesk.Revit.DB.Structure.YJustification

The justification of the framing element in Y.

## Syntax (C#)
```csharp
public enum YJustification
```